[
  {
    "title": "A prospective longitudinal study of the changes in multidimensional fatigue and its associated factors in patients undergoing brachytherapy for cervical cancer",
    "description": "Scientific Reports - A prospective longitudinal study of the changes in multidimensional fatigue and its associated factors in patients undergoing brachytherapy for cervical cancer",
    "source": "Nature.com",
    "publishedAt": "2025-10-07T00:00:00Z",
    "url": "https://www.nature.com/articles/s41598-025-19219-9"
  },
  {
    "title": "Sora, AI Bicycles, and Meta Disruption",
    "description": "The App Store charts tell the story, at least for the first week of AI-generated video apps:\nThis doesn’t, somewhat embarrassingly, match my initial impressions: I liked the Vibes addition to the MetaAI app and was somewhat cool on Sora. I spent much of last …",
    "source": "Biztoc.com",
    "publishedAt": "2025-10-06T23:47:12Z",
    "url": "https://biztoc.com/x/2266563145950599"
  },
  {
    "title": "Cerebras CEO insists dinner-plate-sized chip startup will still go public",
    "description": "Inference service launched a month before IPO filing turns out to have been a much bigger business than initially thought Just days after announcing a $1.1 billion Series G funding round, AI chip startup Cerebras Systems pulled its S-1 IPO filing without so m…",
    "source": "Theregister.com",
    "publishedAt": "2025-10-06T23:30:09Z",
    "url": "https://www.theregister.com/2025/10/06/cerebras_ipo_rest/"
  },
  {
    "title": "Why fears of a trillion-dollar AI bubble are growing",
    "description": "Even some of AI’s biggest cheerleaders acknowledge the market is frothy.",
    "source": "The Denver Post",
    "publishedAt": "2025-10-06T23:16:09Z",
    "url": "https://www.denverpost.com/2025/10/06/ai-bubble-fears/"
  },
  {
    "title": "Why fears of a trillion-dollar AI bubble are growing",
    "description": "Even some of AI’s biggest cheerleaders acknowledge the market is frothy.",
    "source": "Boston Herald",
    "publishedAt": "2025-10-06T23:16:09Z",
    "url": "https://www.bostonherald.com/2025/10/06/ai-bubble-fears/"
  }
]